InformationRegisters/НастройкиВеденияЖурналовЗагрузкиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВеденияЖурналовЗагрузкиДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантВеденияЖурнала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВеденияЖурналовЗагрузкиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОчисткиДанныхЖурнала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОчисткиЖурналовЗагрузкиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокХраненияДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыВеденияЖурналовЗагрузкиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВариантыВеденияЖурналовЗагрузкиДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершившиесяСОшибками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОчисткиЖурналовЗагрузкиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВариантыОчисткиЖурналовЗагрузкиДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОчищать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Очистить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиВеденияЖурналовЗагрузкиДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

// Заполняет регистр сведений НастройкиВеденияЖурналовЗагрузкиДанных.
//
Процедура ЗаполнитьНастройкиВеденияЖурналовЗагрузкиДанных() Экспорт
	
	МассивИменЖурналов = Новый Массив;
	МассивИменЖурналов.Добавить("РегистрСведений.ЖурналЗагрузкиДанныхПоВСД");
	МассивИменЖурналов.Добавить("РегистрСведений.ЖурналЗагрузкиДанныхПоЗаписямСкладскогоЖурнала");
	МассивИменЖурналов.Добавить("РегистрСведений.ЖурналВыполненияРегламентныхЗаданий");
	МассивИменЖурналов.Добавить("РегистрСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя В (&МассивИменЖурналов)");
	Запрос.УстановитьПараметр("МассивИменЖурналов", МассивИменЖурналов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.НастройкиВеденияЖурналовЗагрузкиДанных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидОбъекта.Установить(Выборка.Ссылка);
		
		//Данные уже есть в регистре трогать не будем
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
	
		НоваяЗапись  = НаборЗаписей.Добавить();
		НоваяЗапись.ВидОбъекта = Выборка.Ссылка;
		НоваяЗапись.ВариантВеденияЖурнала       = Перечисления.ВариантыВеденияЖурналовЗагрузкиДанных.Полный;
		НоваяЗапись.ВариантОчисткиДанныхЖурнала = Перечисления.ВариантыОчисткиЖурналовЗагрузкиДанных.НеОчищать;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
